Revit 2027 API
SelectionChangedEventArgs Properties
The SelectionChangedEventArgs type exposes the following members.
Properties
Name | Description
Cancellable |  Indicates whether an event may be cancelled by an event delegate.
(Inherited from RevitAPIEventArgs)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from RevitAPIEventArgs)
Top
See Also
Reference
SelectionChangedEventArgs Class
Autodesk.Revit.UI.Events Namespace